#include <stdio.h> 
#define _USE_MATH_DEFINES
#include<math.h>
#include <locale.h>


void main() {
    setlocale(LC_ALL, "RUS");
    int gold = 0, silver = 0, bronse = 0, racers = 20, i = 0, racer[20][3] =
    { {15, 12, 14},
        {10, 16, 18},
        {17, 20, 18},
        {13, 14, 15},
        {11, 15, 14},
        {12, 10, 15},
        {17, 18, 19},
        {19, 16, 17},
        {10, 15, 14},
        {13, 20, 19},
        {15, 12, 11},
        {13, 14, 15},
        {14, 16, 18},
        {20, 21, 10},
        {14, 21, 10},
        {10, 12, 13},
        {10, 12, 11},
        {10, 19, 18},
        {18, 10, 20},
        {12, 13, 14} };
    for (int g = 0; g < 20; g++) {
        if ((racer[g][0] +50) >= gold) {
            silver = gold;
            gold = racer[g][0] + 50;
        }
        else if ((racer[g][0] + 50) >= silver) {
            bronse = silver;
            silver = racer[g][0] + 50;
        }
        else  if ((racer[g][0] + 50) >= bronse) bronse = racer[g][0] + 5;
    } //нахождение 1,2,3 мест
   //6 Таблица соревнований в которой приняли участие 20 спортсменов, 
    //задана 2-х мерным массивом из 20 строк и 3 столбцов, в котором значения
    //(время первого круга, время второго круга, время третьего круга) элементов  заданы в файле данных.
    printf("________________________________________________________________________________________\n");
    printf("|   Гонщик   | время 1 круга|время 2 круга|время 3 круга|Фамилия|Очки|Место\n");
    for (int n = 0; n < 20; n++) {
        printf("----------------------------------------------------------------------------------------\n");
        printf("|%2d-ой гонщик|     %3d      |    %3d      |  %3d      |", n + 1, racer[n][i], racer[n][i + 1], racer[n][i + 2]);
        char racername[20][10] = {
            {'С','а','с','т','р','е',' ',' ',' ',' '},
            {'А','в','е','р','м','а','т',' ',' ',' '},
            {'Г','р','а','й','п','е','л','ь',' ',' '},
            {'М','а','р','т','и','н',' ',' ',' ',' '},
            {'Р','о','д','р','и','г','е','с',' ',' '},
            {'П','е','т','а','к','к','и',' ',' ',' '},
            {'Ф','р','е','й','р','е',' ',' ',' ',' '},
            {'К','и','н','т','а','н','а',' ',' ',' '},
            {'В','и','н','о','к','у','р','о','в',' '},
            {'Э','в','а','н','с',' ',' ',' ',' ',' '},
            {'С','а','г','а','н',' ',' ',' ',' ',' '},
            {'Б','е','т','т','и','н','и',' ',' ',' '},
            {'К','э','в','е','н','д','и','ш',' ',' '},
            {'Б','о','о','н','е','н',' ',' ',' ',' '},
            {'Ж','и','л','ь','б','е','р',' ',' ',' '},
            {'Ф','р','у','м',' ',' ',' ',' ',' ',' '},
            {'К','о','н','т','а','д','о','р',' ',' '},
            {'Н','и','б','а','л','и',' ',' ',' ',' '},
            {'В','а','л','ь','в','е','р','д','е',' '},
            {'К','а','н','ч','е','л','л','а','р','а'} };
        printf(" %c%c%c%c%c%c%c%c%c%c |", racername[n][0], racername[n][1], racername[n][2], racername[n][3], racername[n][4], racername[n][5], racername[n][6], racername[n][7], racername[n][8], racername[n][9]);
        printf(" % 3d | ", racername[n][i] + 50);

        if ((racername[n][0] + 50) == gold) printf(" 1-ое |\n");
        else if ((racername[n][0] + 50) == silver) printf(" 2-ое |\n");
        else if ((racername[n][0] + 50) == bronse) printf(" 3-ое |\n");
        else printf("      |\n");
    }
    printf("----------------------------------------------------------------------------------------\n");
}
